{
    "reviewGroups": [
        {
            "id": 1,
            "reviews": [
                {
                    "reviewerName": "Ashta Gondaliya",
                    "avatarUrl": "./assets/images/Tom.jpg",
                    "rating": 4.8,
                    "DateAndTime": "3:15 PM · Jan 3, 2025",
                    "comment": "Quick signup and KYC. AED transfer was smooth. Great service."
                },
                {
                    "reviewerName": "Michael Johnson",
                    "avatarUrl": "./assets/images/John.png",
                    "rating": 4.5,
                    "DateAndTime": "10:12 AM · Jan 4, 2025",
                    "comment": "The instant account setup was genuinely fast. KYC was simpler than I expected. Funding my USD wallet and sending to India was straightforward. Being able to save recipient details is a huge time saver."
                },
                {
                    "reviewerName": "Nilesh Patel",
                    "avatarUrl": "./assets/images/Ryan.jpg",
                    "rating": 5.0,
                    "DateAndTime": "11:05 AM · Jan 4, 2025",
                    "comment": "So easy! Sent USD to INR in minutes. Love it!"
                }
            ]
        },
        {
            "id": 2,
            "reviews": [
                {
                    "reviewerName": "Krish Shihora",
                    "avatarUrl": "./assets/images/krunal.jpg",
                    "rating": 5.0,
                    "DateAndTime": "2:55 PM · Jan 3, 2025",
                    "comment": " Impressed with the ease of creating a EUR wallet. Bank transfer for funding was clear. Adding my family's Indian bank details (IFSC code and all) was simple. Transfer status tracking is very helpful."
                },
                {
                    "reviewerName": "Isabella Garcia",
                    "avatarUrl": "./assets/images/Lisa-Carter.jpg",
                    "rating": 5.0,
                    "DateAndTime": "12:35 PM · Jan 4, 2025",
                    "comment": " I was looking for a reliable and simple way to send USD to my parents in India, and this website is perfect! The 'instant account' setup actually lived up to its name – just basic details and I was in. The KYC process was surprisingly quick and unlocked everything. Creating the USD digital wallet and adding funds via bank transfer was very clear. I especially loved how easy it was to add my parents as recipients with their bank account number and IFSC code, and that I can save their details for future transfers. The final step of sending the money was just a few clicks, and the tracking feature gave me complete peace of mind. Five stars!"
                },
                {
                    "reviewerName": "Isha Bhatt",
                    "avatarUrl": "./assets/images/Amelia.jpg",
                    "rating": 4.7,
                    "DateAndTime": "10:00 AM · Jan 2, 2025",
                    "comment": "I was a bit apprehensive about online money transfers, but this website made it so easy. The initial sign-up asked for just basic details. The KYC was a simple verification step, and after that, I had full access to create my GBP wallet. The instructions for adding funds via bank transfer were clear and easy to follow. What I really appreciated was the recipient management – I entered my sister's full name, her Indian bank account number, and the IFSC code, and now she's saved for future transfers. Sending the money was then just a matter of selecting her, my wallet, and the amount. I could even track the transaction status, which was reassuring."
                }
            ]
        },
        {
            "id": 3,
            "reviews": [
                {
                    "reviewerName": "Sanjay Parmar",
                    "avatarUrl": "./assets/images/Sarah.jpg",
                    "rating": 4.9,
                    "DateAndTime": "5:50 PM · Jan 3, 2025",
                    "comment": " I've used a few services to send AED to India, but this one stands out for its simplicity. The signup really is quick, and the KYC verification didn't take long at all. Once that was done, setting up my AED wallet and transferring funds into it from my bank was smooth. The best part for me is managing recipients; I send to different family members, and being able to add all their details (name, bank account, IFSC) and save them is incredibly convenient. Initiating the transfer itself is very intuitive – select wallet, select recipient, enter amount, confirm. The tracking is also a great feature. Definitely my new go-to."
                },
                {
                    "reviewerName": "Avni Goyani",
                    "avatarUrl": "./assets/images/Emily.avif",
                    "rating": 5.0,
                    "DateAndTime": "6:22 PM · Jan 1, 2025",
                    "comment": "EUR to INR, fast and reliable. Tracking is a plus!"
                },
                {
                    "reviewerName": "Arman Malik",
                    "avatarUrl": "./assets/images/Jake.jpg",
                    "location": "Austin, TX",
                    "rating": 4.1,
                    "DateAndTime": "06:33 AM · May 25, 2024",
                    "comment": "Excellent platform! GBP wallet setup was a breeze. Highly recommend."
                },
                {
                    "reviewerName": "Smith Carter",
                    "avatarUrl": "./assets/images/Liam.jpg",
                    "rating": 4.2,
                    "DateAndTime": "9:02 AM · Jan 3, 2025",
                    "comment": "Good overall service for GBP to INR. Signup and KYC were quick. I appreciate being able to manage multiple recipients. The transfer was completed in a reasonable time."
                },
                {
                    "reviewerName": "Noora Al Hammadi",
                    "avatarUrl": "./assets/images/Sofia.png",
                    "rating": 5.0,
                    "DateAndTime": "7:30 PM · Jan 2, 2025",
                    "comment": "Finally, a truly user-friendly way to send AED to India! The wallet creation is intuitive, and adding funds was no hassle. Selecting the recipient and sending money was very quick."
                }
            ]
        },
        {
            "id": 4,
            "reviews": [
                {
                    "reviewerName": "Hit Lakhani",
                    "avatarUrl": "./assets/images/Sarah.jpg",
                    "rating": 4.5,
                    "DateAndTime": "10:00 AM · Jan 2, 2025",
                    "comment": " I was a bit apprehensive about online money transfers, but this website made it so easy. The initial sign-up asked for just basic details. The KYC was a simple verification step, and after that, I had full access to create my GBP wallet. The instructions for adding funds via bank transfer were clear and easy to follow. What I really appreciated was the recipient management – I entered my sister's full name, her Indian bank account number, and the IFSC code, and now she's saved for future transfers. Sending the money was then just a matter of selecting her, my wallet, and the amount. I could even track the transaction status, which was reassuring."
                },
                {
                    "reviewerName": "Ben Stock",
                    "avatarUrl": "./assets/images/Jake.jpg",
                    "rating": 4.8,
                    "DateAndTime": "3:40 PM · Jan 1, 2025",
                    "comment": "Excellent service for EUR to INR transfers. The commitment to 'easy and simple steps' is evident throughout the process. Account setup was indeed quick. KYC verification was handled efficiently, unlocking the wallet creation and international transfer capabilities. I created my EUR wallet, added funds through a bank transfer without any hitches. Adding my beneficiary in India, including their bank details like IFSC code, was straightforward, and the option to save these details is very practical for repeat transactions. The final transfer initiation was just a few clicks, and the ability to track the transaction's progress is a valuable feature."
                },
                {
                    "reviewerName": "Fatima A.",
                    "avatarUrl": "./assets/images/Emily.avif",
                    "rating": 4,
                    "DateAndTime": "4:10 PM · Dec 28, 2024",
                    "comment": "Best AED to INR service I've found. Truly simple."
                },
                {
                    "reviewerName": "David W.",
                    "avatarUrl": "./assets/images/Liam.jpg",
                    "rating": 4.7,
                    "DateAndTime": "1:50 PM · Dec 30, 2025",
                    "comment": "Simple steps as promised. Adding recipients is very easy."
                },
                {
                    "reviewerName": "Samuel Green",
                    "avatarUrl": "./assets/images/Sofia.png",
                    "rating": 5.0,
                    "DateAndTime": "8:18 AM · Dec 30, 2025",
                    "comment": "Solid platform. Signup was fast, KYC was straightforward. Funded my GBP wallet without issues. Initiating the transfer to India and tracking its status was easy. Will use again."
                }
            ]
        },
        {
            "id": 5,
            "reviews": [
                {
                    "reviewerName": "Vinit Ghelani",
                    "avatarUrl": "./assets/images/Emily.avif",
                    "rating": 4.6,
                    "DateAndTime": "6:05 PM · Dec 29, 2025",
                    "comment": "I needed to send USD to a colleague in India. This website provided a very streamlined experience. The quick account setup with basic details got me started fast. Completing the simple KYC verification unlocked the wallet and transfer features smoothly. I created a USD digital wallet and funded it via bank transfer. Adding my colleague's recipient details, including their full name, bank account number, and the bank's IFSC code, was easy, and I appreciate that I can save these for potential future use. Initiating the transfer was just a matter of selecting the funded wallet, the recipient, and entering the amount. The transaction tracking was a nice touch to monitor progress."
                },
                {
                    "reviewerName": "Chelsy Desai",
                    "avatarUrl": "./assets/images/Sarah.jpg",
                    "rating": 4.1,
                    "DateAndTime": "4:05 PM · Dec 31, 2025",
                    "comment": "Used this for a EUR transfer. The process of adding my recipient and their bank details was very clear. I like that I can save them for next time. The digital wallet system is also very convenient."
                },
                {
                    "reviewerName": "Aarav Sharma",
                    "avatarUrl": "./assets/images/Jake.jpg",
                    "rating": 5.0,
                    "DateAndTime": "9:20 AM · Dec 31, 2025",
                    "comment": "My father needed to receive funds from a relative in the UK (GBP). I helped him check out this platform from the sender's perspective (as described). The sender confirmed the signup was very fast, and KYC was simpler than other platforms. They easily created a GBP wallet, funded it, and then added my father's Indian bank details (account number, IFSC code) as a recipient. The sender mentioned how easy it was to save these details. The money arrived in my father's account quickly, and the sender could track it all the way. This service seems to make a complex process very simple for everyone involved."
                },
                {
                    "reviewerName": "Rushil Vaghela",
                    "avatarUrl": "./assets/images/Liam.jpg",
                    "rating": 4.9,
                    "DateAndTime": "11:45 AM · Jan 1, 2025",
                    "comment": "The platform delivers on its promise of simple steps. Quick account setup, easy KYC, and my USD wallet was ready to go. Transferring to India was seamless. Happy with the transaction tracking."
                },
                {
                    "reviewerName": "Chen L.",
                    "avatarUrl": "./assets/images/Sofia.png",
                    "rating": 4.6,
                    "DateAndTime": "4:05 PM · Jan 9, 2025",
                    "comment": "Good experience. USD wallet funded easily. Transaction went well."
                }
            ]
        }
    ]
}